hdscmcu/hc32f120/DeviceDriverLibrary/hc32f120_ddl/driver/src/hc32f120_i2c.c
        /* I2C baudrate config */
        I2C_BaudrateConfig(pstcI2C_InitStruct, pf32Err);

        /* Disable global broadcast address function */
        bM0P_I2C->CR1_b.GCEN = 1u;

        /* Release software reset */
        bM0P_I2C->CR1_b.SWRST = 0u;
        /* Disable I2C peripheral */
        bM0P_I2C->CR1_b.PE = 0u;
    }
    return enRet;
}

/**
 * @brief  I2C function command
 * @param  [in] enNewState           New state of the I2Cx function,
 *                                   @ref en_functional_state_t

 * @retval None
 */
void I2C_Cmd(en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    bM0P_I2C->CR1_b.PE = enNewState;
}

/**
 * @brief  I2C SMBUS function configuration
 * @param  [in] SmbusConfig       Indicate the SMBUS function configuration
 *         This parameter can be one or any combination of the configure items,
 *         @ref I2C_Smbus_config
 *         @arg  I2C_SMBUS_ALRTEN    : Smbus alarm address enable
 *         @arg  I2C_SMBUS_DEFAULTEN : Smbus default address enable
 *         @arg  I2C_SMBUS_HOSTEN    : Smbus host address address enable
 *         @arg  I2C_SMBUS_DISEN     : Smbus mode disable
 * @retval None
 */
void I2C_SmbusConfig(uint32_t SmbusConfig)
{
    DDL_ASSERT(IS_VALID_SMBUS_CONFIG(SmbusConfig));

    MODIFY_REG(M0P_I2C->CR1, I2C_SMBUS_CONFIG_CLEARMASK, SmbusConfig);
}

/**
 * @brief  I2C SMBUS function command
 * @param  [in] enNewState           New state of the I2Cx SMBUS function,
 *                                   @ref en_functional_state_t
 * @retval None
 */
void I2C_SmBusCmd(en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    bM0P_I2C->CR1_b.SMBUS = enNewState;
}

/**
 * @brief  I2C software reset function command
 * @param  [in] enNewState           New state of the I2Cx function,
 *                                   @ref en_functional_state_t
 * @retval None
 */
void I2C_SoftwareResetCmd(en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    bM0P_I2C->CR1_b.SWRST = enNewState;
}

/**
 * @brief  I2C digital filter function configuration
 * @param  [in] DigFilterMode        Chose the digital filter mode,
 *                                   @ref I2C_Digital_Filter_mode
 * @retval None
 */
void I2C_DigitalFilterConfig(uint32_t DigFilterMode)
{
    DDL_ASSERT(IS_VALID_DIGITAL_FILTER(DigFilterMode));

    MODIFY_REG(M0P_I2C->FLTR, I2C_FLTR_DNF, DigFilterMode);
}

/**
 * @brief  I2C digital filter function command
 * @param  [in] enNewState           New state of the I2Cx function,
 *                                   @ref en_functional_state_t
 * @retval None
 */
void I2C_DigitalFilterCmd(en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    bM0P_I2C->FLTR_b.DNFEN = enNewState;
}

/**
 * @brief  I2C analog filter function command
 * @param  [in] enNewState           New state of the I2Cx function,
 *                                   @ref en_functional_state_t
 * @retval None
 */
void I2C_AnalogFilterCmd(en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    bM0P_I2C->FLTR_b.ANFEN = enNewState;
}

/**
 * @brief  I2C general call function command
 * @param  [in] enNewState           New state of the I2Cx function,
 *                                   @ref en_functional_state_t
 * @retval None
 */
void I2C_GeneralCallCmd(en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    bM0P_I2C->CR1_b.GCEN = enNewState;
}

/**
 * @brief  I2C slave address config
 * @param  [in] u32AdrNum            I2C_ADR_0 or I2C_ADR_1 @ref I2C_Adr_Num
 * @param  [in] u32AdrConfig         Address mode configuration,
 *                                   @ref I2C_Adr_Config
 * @param  [in] u32Adr               The slave address
 * @retval None
 */
void I2C_SlaveAdrConfig(uint32_t u32AdrNum, uint32_t u32AdrConfig, uint32_t u32Adr)
{
    DDL_ASSERT(IS_VALID_ADRCONFIG(u32AdrConfig));
    DDL_ASSERT(IS_VALID_ADR_NUM(u32AdrNum));

    if(I2C_ADR_CONFIG_10BIT == u32AdrConfig)
    {
        /* if 10 bit address mode */
        DDL_ASSERT(IS_VALIDE_10BIT_ADR(u32Adr));
        *(__IO uint32_t*)(&M0P_I2C->SLR0 + u32AdrNum) = u32AdrConfig + u32Adr;
    }
    else
    {
        /* if 7 bit address mode */
        DDL_ASSERT(IS_VALID_7BIT_ADR(u32Adr));
        *(__IO uint32_t*)(&M0P_I2C->SLR0 + u32AdrNum) = u32AdrConfig + (u32Adr << 1);
    }
}

/**
 * @brief  I2C interrupt function command
 * @param  [in] u32IntEn   Specifies the I2C interrupts sources to be configuration
 *         This parameter can be any combination of the following values:
 *         @arg    I2C_CR2_STARTIE      : Start flag interrupt
 *         @arg    I2C_CR2_SLADDR0IE    : Address 0 detected interrupt
 *         @arg    I2C_CR2_SLADDR1IE    : Address 1 detected interrupt
 *         @arg    I2C_CR2_TENDIE       : Transfer end interrupt
 *         @arg    I2C_CR2_STOPIE       : Stop flag interrupt
 *         @arg    I2C_CR2_RFULLIE      : Receive buffer full interrupt
 *         @arg    I2C_CR2_TEMPTYIE     : Transfer buffer empty interrupt
 *         @arg    I2C_CR2_ARLOIE       : Arbitration fails interrupt
 *         @arg    I2C_CR2_NACKIE       : NACK flag detected interrupt
 *         @arg    I2C_CR2_GENCALLIE    : General call address detected interrupt
 *         @arg    I2C_CR2_SMBDEFAULTIE : Smbus default address detected interrupt
 *         @arg    I2C_CR2_SMBHOSTIE    : Smbus host address detected interrupt
 *         @arg    I2C_CR2_SMBALRTIE    : Smbus alarm address detected interrupt
 * @param  [in] enNewState           New state of the I2Cx function,
 *                                   @ref en_functional_state_t
 * @retval None
 */
void I2C_IntCmd(uint32_t u32IntEn, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if(Enable == enNewState)
    {
        M0P_I2C->CR2 |= u32IntEn;
    }
    else
    {
        M0P_I2C->CR2 &= ~u32IntEn;
    }
}

/**
 * @brief  I2C send data or address
 * @param  [in] u8Data               The data to be send
 *
 * @retval None
 */
void I2C_SendData( uint8_t u8Data)
{
    M0P_I2C->DTR = u8Data;
}

/**
 * @brief  I2C read data from register
 * @retval The value of the received data
 */
uint8_t I2C_ReadData(void)
{
    return M0P_I2C->DRR;
}

/**
 * @brief  I2C ACK status configuration
 * @param  [in] enNewState           New state of the I2Cx function, can be
 *                                   Disable or Enable the function
 * @retval None
 */
void I2C_NackConfig(en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    bM0P_I2C->CR1_b.ACK = enNewState;
}

/**
 * @brief  I2C status bit get
 * @param  [in] u32StatusBit         specifies the flag to check,
 *         This parameter can be one of the following values:
 *         @arg   I2C_SR_STARTF     : Start condition detected flag
 *         @arg   I2C_SR_SLADDR0F   : Address 0 detected flag
 *         @arg   I2C_SR_SLADDR1F   : Address 1 detected flag
 *         @arg   I2C_SR_TENDF      : Transfer end flag
 *         @arg   I2C_SR_STOPF      : Stop condition detected flag
 *         @arg   I2C_SR_RFULLF     : Receive buffer full flag
 *         @arg   I2C_SR_TEMPTYF    : Transfer buffer empty flag
 *         @arg   I2C_SR_ARLOF      : Arbitration fails flag
 *         @arg   I2C_SR_ACKRF      : NACK detected flag
 *         @arg   I2C_SR_NACKF      : NACK detected flag
 *         @arg   I2C_SR_MSL        : Master mode flag
 *         @arg   I2C_SR_BUSY       : Bus busy status flag
 *         @arg   I2C_SR_TRA        : Transfer mode flag
 *         @arg   I2C_SR_GENCALLF   : General call detected flag
 *         @arg   I2C_SR_SMBDEFAULTF: Smbus default address detected flag
 *         @arg   I2C_SR_SMBHOSTF   : Smbus host address detected flag
 *         @arg   I2C_SR_SMBALRTF   : Smbus alarm address detected flag
 * @retval The status of the I2C status flag, may be Set or Reset.
 */
en_flag_status_t I2C_GetStatus(uint32_t u32StatusBit)
{
    DDL_ASSERT(IS_VALID_RD_STATUS_BIT(u32StatusBit));

    return ((M0P_I2C->SR & u32StatusBit) ? Set : Reset);
}

/**
 * @brief  I2C status bit get
 * @param  [in] u32StatusBit         Specifies the flag to be write,
 *         This parameter can be one of the following values:
 *         @arg  I2C_SR_MSL
 *         @arg  I2C_SR_TRA
 * @param  [in] enStatus             New state of the I2Cx function, can be
 *                                   Disable or Enable the function
 * @retval None
 */
void  I2C_WriteStatus(uint32_t u32StatusBit, en_flag_status_t enStatus)
{
    DDL_ASSERT(IS_VALID_WR_STATUS_BIT(u32StatusBit));

